bit-finance/InformationRegisters/бит_НастройкиЗаполненияАналитикПоНазначениюПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиЗаполненияАналитикПоНазначениюПлатежа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_11</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_12</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаскаНазначенияПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСтредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НастройкиЗаполненияАналитикПоНазначениюПлатежа/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();

	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект, ИзмеренияДоп,
		Новый Соответствие(НастройкиИзмерений));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.СтатьяОборотов) Тогда
		ИзменениеСтатьиОборотовНаСервере(Запись.СтатьяОборотов);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	УстановитьСписокВыбора(ЭтотОбъект);
	Запись.ВидОперации = Элементы.ВидОперации.СписокВыбора[0].Значение;
	
	ПриИзмененииВидаОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
	                                                      	    Элемент,
															    Запись,
															    Элемент.Имя,
															    СтандартнаяОбработка,
															    Новый Соответствие(НастройкиИзмерений));
	
 КонецПроцедуры
 
&НаКлиенте
Процедура Аналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
	                                                      	    Элемент,
															    Запись,
															    Элемент.Имя,
															    СтандартнаяОбработка,
															    Новый Соответствие(НастройкиИзмерений));
                                                               
КонецПроцедуры // Аналитика_АвтоПодбор()

&НаКлиенте
Процедура Аналитика_Очистка(Элемент, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент,
																			Запись,
	                                                                       	Элемент.Имя,
																		   	СтандартнаяОбработка,
																		   	Новый Соответствие(НастройкиИзмерений));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ПриИзмененииВидаОперации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьШаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВставитьШаблонПродолжение", ЭтотОбъект); 
	Если ЗначениеЗаполнено(Запись.МаскаНазначенияПлатежа) Тогда	
		ТекстВопроса = НСтр("ru='Очистить маску назначения платежа?';en='Clear mask for payment?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 30);		
	Иначе	
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте 
Процедура ВставитьШаблонПродолжение(Ответ, ДополнительныеДанные) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ВставитьШаблонОкончание", ЭтотОбъект); 
	ПараметрыФормы = Новый Структура("Шаблон", "");
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Запись.МаскаНазначенияПлатежа = "";
	КонецЕсли; 
	
	ПараметрыФормы.Шаблон = Запись.МаскаНазначенияПлатежа;
	ОткрытьФорму("РегистрСведений.бит_НастройкиЗаполненияАналитикПоНазначениюПлатежа.Форма.ФормаШаблона", 
		ПараметрыФормы,,,,, Оповещение);
		
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте 
Процедура ВставитьШаблонОкончание(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Запись.МаскаНазначенияПлатежа = РезультатВыбора;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИзмеренияДоп	   = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	НастройкиИзмерений = Новый ФиксированноеСоответствие(бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений());
		
	СписаниеСРасчетногоСчета   = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.СписаниеБезналичныхДенежныхСредств);
	ПоступлениеНаРасчетныйСчет = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств);
	
	Элементы.Объект.СписокВыбора.Добавить(СписаниеСРасчетногоСчета);
	Элементы.Объект.СписокВыбора.Добавить(ПоступлениеНаРасчетныйСчет);
	
	Если НЕ ЗначениеЗаполнено(Запись.Объект) Тогда
		Запись.Объект = СписаниеСРасчетногоСчета;	
	КонецЕсли;
	
	ЗаполнитьСпискиВыбора();
	УстановитьСписокВыбора(ЭтотОбъект);
	Если НЕ ЗначениеЗаполнено(Запись.ВидОперации) Тогда
		Запись.ВидОперации = Элементы.ВидОперации.СписокВыбора[0].Значение;
	КонецЕсли;
	
	ЕстьРасшифровкаПалетежа = ЕстьРасшифровкаПлатежа();
	
	Если ЗначениеЗаполнено(Запись.СтатьяОборотов) Тогда
		ИзменениеСтатьиОборотовНаСервере(Запись.СтатьяОборотов);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиОборотовНаСервере(Статья)

	НастройкиСтатьи = Справочники.бит_СтатьиОборотов.ПолучитьНастройки(Запись.СтатьяОборотов);
	бит_Бюджетирование.УстановитьИспользованиеАналитики(Запись, НастройкиСтатьи, ИзмеренияДоп);
	НастроитьВидимостьАналитикБюджетирования();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьАналитикБюджетирования()
	
	МассивСтатей = Новый Массив;
	МассивСтатей.Добавить(Запись.СтатьяОборотов);
	Префикс = "";
	
	МассивИсключаемыхИзмерений = Новый Массив;
	МассивИсключаемыхИзмерений.Добавить("Организация");
	МассивИсключаемыхИзмерений.Добавить("ЦФО");
	МассивИсключаемыхИзмерений.Добавить("СтатьяОборотов");
	МассивИсключаемыхИзмерений.Добавить("Контрагент");
	МассивИсключаемыхИзмерений.Добавить("ДоговорКонтрагента");
	МассивИсключаемыхИзмерений.Добавить("БанковскийСчет");
	
	НастройкаВидимости = бит_Бюджетирование.ПолучитьНастройкуВидимостиКолонок(МассивСтатей, Неопределено);
	
	Для Каждого ТекИзмерение Из МассивИсключаемыхИзмерений Цикл
		
		Если НЕ НастройкаВидимости.Свойство(ТекИзмерение) Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаВидимости.Удалить(ТекИзмерение);
		
	КонецЦикла;
	
	бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы, НастройкаВидимости, Префикс);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Запись	 = Форма.Запись;
	Элементы = Форма.Элементы;
	
	Элементы.ВидОперации.Доступность					= ЗначениеЗаполнено(Запись.Объект);
	Элементы.СтатьяДвиженияДенежныхСтредств.Доступность = ЗначениеЗаполнено(Запись.ВидОперации) 
														И НЕ Форма.ЕстьРасшифровкаПалетежа;
	
КонецПроцедуры

&НаСервере
Функция ЕстьРасшифровкаПлатежа()
	
	ЕстьРасшифровкаПлатежа = Ложь;

	Если Запись.Объект = ПоступлениеНаРасчетныйСчет Тогда
		Ссылка = Документы.ПоступлениеБезналичныхДенежныхСредств.ПустаяСсылка(); 
	ИначеЕсли Запись.Объект = СписаниеСРасчетногоСчета Тогда 	
	   	Ссылка = Документы.СписаниеБезналичныхДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ХозяйственнаяОперация", Запись.ВидОперации);
	Контекст.Вставить("СписокФизЛиц", 		   Ложь);
	Контекст.Вставить("Контрагент", 		   Запись.Контрагент);
	Контекст.Вставить("ОплатаПоЗаявкам", 	   Ложь);
	Контекст.Вставить("Ссылка", 			   Ссылка);
	
	ЕстьРасшифровкаПлатежа = бит_Казначейство.ЕстьРасшифровкаПлатежа(Контекст);
	
	Возврат ЕстьРасшифровкаПлатежа;

КонецФункции

&НаКлиенте
Процедура ПриИзмененииВидаОперации()
	
	Если ЗначениеЗаполнено(Запись.ВидОперации) Тогда
		ЕстьРасшифровкаПалетежа = ЕстьРасшифровкаПлатежа();
	Иначе	
		ЕстьРасшифровкаПалетежа = Ложь; 
	КонецЕсли;
	
	Если ЕстьРасшифровкаПалетежа Тогда
		Запись.СтатьяДвиженияДенежныхСтредств = Неопределено;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()

	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику, НСтр("ru = 'Выдача подотчетнику'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеТаможне);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию, НСтр("ru = 'Оплата другой организации'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств, НСтр("ru = 'Передача между организацией и филиалом'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ОплатаАрендодателю);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет, НСтр("ru = 'Перечисление на другой счет'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств, НСтр("ru = 'Инкассация из банка'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоКредитам);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВыдачаЗаймов, НСтр("ru = 'Выдача займа контрагенту'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику, НСтр("ru = 'Выдача займа сотруднику'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.КонвертацияВалюты);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств, НСтр("ru = 'Прочий расход'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию, НСтр("ru = 'Возврат в другую организацию'"));
	ВидыОперацийСписания.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту, НСтр("ru = 'Возврат оплаты по эквайрингу'"));

	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте, НСтр("ru = 'Поступление оплаты по эквайрингу'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации, НСтр("ru = 'Поступление от другой организации'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств, НСтр("ru = 'Передача между организацией и филиалом'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствСДругогоСчета, НСтр("ru = 'Поступление с другого счета'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет, НСтр("ru = 'Инкассация в банк'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоКредитам, НСтр("ru = 'Поступление по кредитам и займам полученным'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоДепозитам, НСтр("ru = 'Поступление по депозитам'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоЗаймамВыданным, НСтр("ru = 'Погашение займа контрагентом'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПогашениеЗаймаСотрудником, НСтр("ru = 'Погашение займа сотрудником'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.КонвертацияВалюты);
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств, НСтр("ru = 'Прочее поступление'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика, НСтр("ru = 'Возврат или иное поступление от поставщика'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника, НСтр("ru = 'Возврат от подотчетника'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации, НСтр("ru = 'Возврат от другой организации'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтАрендодателя, НСтр("ru = 'Возврат от арендодателя'"));
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратНеперечисленныхДС);
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту);
	ВидыОперацийПоступления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратНалогов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСписокВыбора(Форма)
	
	Запись	 = Форма.Запись;
	Элементы = Форма.Элементы;
	
	НовыйСписок = Новый СписокЗначений;

	Если Запись.Объект = Форма.ПоступлениеНаРасчетныйСчет Тогда
		НовыйСписок = Форма.ВидыОперацийПоступления; 
	ИначеЕсли Запись.Объект = Форма.СписаниеСРасчетногоСчета Тогда 	
		НовыйСписок = Форма.ВидыОперацийСписания;
	КонецЕсли;
	
	Элементы.ВидОперации.СписокВыбора.Очистить();
	Для каждого Элемент Из НовыйСписок Цикл
		ЗаполнитьЗначенияСвойств(Элементы.ВидОперации.СписокВыбора.Добавить(), Элемент);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
